const questions= [
    "Не можете знайти відповідь? "+"<br>"+" Зв'яжіться з нами!",
    "Чи зберігає сайт особисту інформацію про мою дитину?",
    "Чи зможе дитина сама вчитись?",
    "Якщо моя дитина не вміє читати?",
    "Як змінити пароль?",
    "Скільки разів можна проходити один курс?"];
const answers = [
    'Напишіть нам',
    'Сайт не зберігає ніякої особистої інформації, реєстрація потрібна тільки для збереження інформації про те, на якому місці курсу ви зупинилися та здобутих нагород',
    'Система нагород розроблена з метою заохочення дитини до самостійного навчання, дизайн сайту інтуїтивно зрозумілий, курси містять багато зображень. Єдина вимога до дитини - вміти читати та хотіти вчитись.',
    'Тоді ви можете проходити курс разом, читаючи їй вголос і показуючи ілюстрації. Так засвоєння інформації буде ще кращим.',
    'На сторінці профілю натисіть на кнопку "Редагувати контакт" і з\'явиться кнопка зміни паролю',
    'Матеріали курсу можна повторно переглядати скільки завгодно разів, так само як і проходити тести'];

function fill_questions(){
    for(let i=0;i<questions.length;i++){

        if(i==0)
            $("#help_thread1").append("<div class='question_board'><p >"+questions[i]+"</p><hr color=' #303030'><textarea class='form-control' rows='3' id='client_question'></textarea><button class='btn btn-info ' id='send_mess_button'>Відправити</button></div>");
        if(i%3===0&&i!=0){
            $("#help_thread1").append("<div class='question_board'><p >"+questions[i]+"</p><hr><p>"+answers[i]+"</p></div>");
        }
        if(i%3===1){
            $("#help_thread2").append("<div class='question_board'><p >"+questions[i]+"</p><hr><p >"+answers[i]+"</p></div>");
        }
        if(i%3===2){
            $("#help_thread3").append("<div class='question_board'><p '>"+questions[i]+"</p><hr><p >"+answers[i]+"</p></div>");
        }

    }
}
fill_questions();

